{com}. 
. ***************************************************************
. ************** INITILIZATION                      *************
. ***************************************************************
. *1.Asset, Liability
. import excel using ..\RawData\DEratio\FS_Combas.xls, firstrow clear
{res}{txt}
{com}. drop in 1/2
{txt}(2 observations deleted)

{com}. rename A001000000 Asset
{res}{txt}
{com}. rename A002000000 Liability
{res}{txt}
{com}. save DEratio1.dta, replace
{txt}file DEratio1.dta saved

{com}. 
. import excel using ..\RawData\DEratio\FS_Combas1.xls, firstrow clear
{res}{txt}
{com}. drop in 1/2
{txt}(2 observations deleted)

{com}. rename A001000000 Asset
{res}{txt}
{com}. rename A002000000 Liability
{res}{txt}
{com}. save DEratio2.dta, replace
{txt}file DEratio2.dta saved

{com}. 
. use DEratio1.dta, clear
{txt}
{com}. append using DEratio2.dta
{txt}
{com}. sort Stkcd Accper
{txt}
{com}. save DEratio.dta, replace
{txt}file DEratio.dta saved

{com}. 
. *2.ROE
. import excel using ..\RawData\ROE\FI_T5.xls, firstrow clear
{res}{txt}
{com}. drop in 1/2
{txt}(2 observations deleted)

{com}. rename F050504C ROE
{res}{txt}
{com}. save ROE1.dta, replace
{txt}file ROE1.dta saved

{com}. 
. import excel using ..\RawData\ROE\FI_T51.xls, firstrow clear
{res}{txt}
{com}. drop in 1/2
{txt}(2 observations deleted)

{com}. rename F050504C ROE
{res}{txt}
{com}. save ROE2.dta, replace
{txt}file ROE2.dta saved

{com}. 
. use ROE1.dta, clear
{txt}
{com}. append using ROE2.dta
{txt}
{com}. bysort Stkcd Accper: keep if _n==1
{txt}(17001 observations deleted)

{com}. sort Stkcd Accper
{txt}
{com}. save ROE.dta, replace
{txt}file ROE.dta saved

{com}. 
. *3.IPO Information
. import excel using ..\RawData\IPO\IPO_Cobasic.xls, firstrow clear
{res}{txt}
{com}. drop in 1/2
{txt}(2 observations deleted)

{com}. sort Stkcd
{txt}
{com}. save IPO.dta, replace
{txt}file IPO.dta saved

{com}. 
. *4.Accounting Period
. import excel using ..\RawData\AccountingPeriod\IAR_Rept.xls, firstrow clear
{res}{txt}
{com}. drop in 1/2
{txt}(2 observations deleted)

{com}. save AccountingPeriod1.dta, replace
{txt}file AccountingPeriod1.dta saved

{com}. 
. import excel using ..\RawData\AccountingPeriod\IAR_Rept1.xls, firstrow clear
{res}{txt}
{com}. drop in 1/2
{txt}(2 observations deleted)

{com}. save AccountingPeriod2.dta, replace
{txt}file AccountingPeriod2.dta saved

{com}. 
. use AccountingPeriod1.dta
{txt}
{com}. append using AccountingPeriod2.dta
{txt}
{com}. sort Stkcd Accper
{txt}
{com}. save AccountingPeriod.dta, replace
{txt}file AccountingPeriod.dta saved

{com}. 
. *5.Control Variables
. *5.1.Tax Rate
. import excel using ..\RawData\Control_IncomeTaxRate\FN_Fn004.xls, firstrow clear
{res}{txt}
{com}. drop in 1/2
{txt}(2 observations deleted)

{com}. rename Fn00410 IncomeTaxRate
{res}{txt}
{com}. sort Stkcd
{txt}
{com}. save IncomeTaxRate.dta, replace
{txt}file IncomeTaxRate.dta saved

{com}. 
. *5.2.Liquidity Ratio
. import excel using ..\RawData\Control_Liquidity\CSR_Finidx.xls, firstrow clear
{res}{txt}
{com}. drop in 1/2
{txt}(2 observations deleted)

{com}. rename T10100 LiquidityRatio
{res}{txt}
{com}. sort Stkcd Accper
{txt}
{com}. save LiquidityRatio.dta, replace
{txt}file LiquidityRatio.dta saved

{com}. 
. *5.3.P/B Ratio
. import excel using ..\RawData\Control_PBratio\FI_T10.xls, firstrow clear
{res}{txt}
{com}. drop in 1/2
{txt}(2 observations deleted)

{com}. rename F101001A PBRatio
{res}{txt}
{com}. save PBRatio1.dta, replace
{txt}file PBRatio1.dta saved

{com}. 
. import excel using ..\RawData\Control_PBratio\FI_T101.xls, firstrow clear
{res}{txt}
{com}. drop in 1/2
{txt}(2 observations deleted)

{com}. rename F101001A PBRatio
{res}{txt}
{com}. save PBRatio2.dta, replace
{txt}file PBRatio2.dta saved

{com}. 
. use PBRatio1.dta, clear
{txt}
{com}. append using PBRatio2.dta
{txt}
{com}. sort Stkcd Accper
{txt}
{com}. save PBRatio.dta, replace
{txt}file PBRatio.dta saved

{com}. 
. *5.4.SG&A
. import excel using ..\RawData\Control_SG&A\FI_T5.xls, firstrow clear
{res}{txt}
{com}. drop in 1/2
{txt}(2 observations deleted)

{com}. save SGA1.dta, replace
{txt}file SGA1.dta saved

{com}. 
. import excel using ..\RawData\Control_SG&A\FI_T51.xls, firstrow clear
{res}{txt}
{com}. drop in 1/2
{txt}(2 observations deleted)

{com}. save SGA2.dta, replace
{txt}file SGA2.dta saved

{com}. 
. use SGA1.dta, clear
{txt}
{com}. append using SGA2.dta
{txt}
{com}. rename F051701C Se
{res}{txt}
{com}. rename F052001C SGAe
{res}{txt}
{com}. bysort Stkcd Accper (SGAe): keep if _n==1
{txt}(17001 observations deleted)

{com}. sort Stkcd Accper
{txt}
{com}. save SGA.dta, replace
{txt}file SGA.dta saved

{com}. 
. *5.5.Top 10 Shareholders
. cd ..\RawData\Control_Top10Shareholders\
{res}D:\GitHub\Coursework\Finance\Advanced Financial Econometrics 2014F\Assignment II\RawData\Control_Top10Shareholders
{txt}
{com}. local file : dir . files "*.xls",nofail
{txt}
{com}. gen filename=""
{txt}(86653 missing values generated)

{com}. local obs = 1
{txt}
{com}. foreach f of local file {c -(}
{txt}  2{com}.         import excel using "`f'", firstrow clear
{txt}  3{com}.         gen source = "`obs'"
{txt}  4{com}.         save "..\..\WorkingData\Shareholders_`obs'", replace
{txt}  5{com}.         local obs = `obs' +1
{txt}  6{com}. {c )-}
{res}{txt}file ..\..\WorkingData\Shareholders_1.dta saved
{res}{txt}file ..\..\WorkingData\Shareholders_2.dta saved
{res}{txt}file ..\..\WorkingData\Shareholders_3.dta saved
{res}{txt}file ..\..\WorkingData\Shareholders_4.dta saved
{res}{txt}file ..\..\WorkingData\Shareholders_5.dta saved
{res}{txt}file ..\..\WorkingData\Shareholders_6.dta saved
{res}{txt}file ..\..\WorkingData\Shareholders_7.dta saved
{res}{txt}file ..\..\WorkingData\Shareholders_8.dta saved

{com}. 
. 
. cd ..\..\WorkingData\
{res}D:\GitHub\Coursework\Finance\Advanced Financial Econometrics 2014F\Assignment II\WorkingData
{txt}
{com}. 
. use Shareholders_1.dta, clear
{txt}
{com}. local end = `obs' - 1
{txt}
{com}. forvalue i = 2(1)`end'{c -(}
{txt}  2{com}.         append using "Shareholders_`i'.dta"
{txt}  3{com}. {c )-}
{txt}S0301a was {res}str84{txt} now {res}str126
{txt}
{com}. 
. gen lenSKT = strlen(Stkcd)
{txt}
{com}. keep if lenSKT == 6
{txt}(16 observations deleted)

{com}. drop lenSKT
{txt}
{com}. rename Reptdt Accper
{res}{txt}
{com}. rename S0301a ShareholderName
{res}{txt}
{com}. rename S0304a ShareholderRatio  
{res}{txt}
{com}. 
. destring ShareholderRatio, replace
{txt}ShareholderRatio has all characters numeric; {res}replaced {txt}as {res}double
{txt}
{com}. gen nShareholderRatio = -ShareholderRatio
{txt}
{com}. gen HHI = ShareholderRatio^2/10000
{txt}
{com}. bysort Stkcd Accper (nShareholderRatio): gen HHIsum = sum(HHI)
{txt}
{com}. bysort Stkcd Accper (nShareholderRatio): gen HHI5 = HHIsum[5]
{txt}(95 missing values generated)

{com}. bysort Stkcd Accper (nShareholderRatio): gen HHI10 = HHIsum[10]
{txt}(890 missing values generated)

{com}. bysort Stkcd Accper (nShareholderRatio): drop if _n>1
{txt}(389980 observations deleted)

{com}. keep Stkcd Accper HHI*
{txt}
{com}. drop HHIsum
{txt}
{com}. sort Stkcd Accper
{txt}
{com}. save Shareholders.dta, replace
{txt}file Shareholders.dta saved

{com}. 
. *5.6.CEO
. cd ..\RawData\Control_CEO\
{res}D:\GitHub\Coursework\Finance\Advanced Financial Econometrics 2014F\Assignment II\RawData\Control_CEO
{txt}
{com}. local file : dir . files "*.xls",nofail
{txt}
{com}. gen filename=""
{txt}(43228 missing values generated)

{com}. local obs = 1
{txt}
{com}. foreach f of local file {c -(}
{txt}  2{com}.         import excel using "`f'", firstrow clear
{txt}  3{com}.         gen source = "`obs'"
{txt}  4{com}.         save "..\..\WorkingData\CEO_`obs'", replace
{txt}  5{com}.         local obs = `obs' +1
{txt}  6{com}. {c )-}
{res}{txt}file ..\..\WorkingData\CEO_1.dta saved
{res}{txt}file ..\..\WorkingData\CEO_2.dta saved
{res}{txt}file ..\..\WorkingData\CEO_3.dta saved
{res}{txt}file ..\..\WorkingData\CEO_4.dta saved
{res}{txt}file ..\..\WorkingData\CEO_5.dta saved
{res}{txt}file ..\..\WorkingData\CEO_6.dta saved
{res}{txt}file ..\..\WorkingData\CEO_7.dta saved

{com}. 
. 
. cd ..\..\WorkingData\
{res}D:\GitHub\Coursework\Finance\Advanced Financial Econometrics 2014F\Assignment II\WorkingData
{txt}
{com}. 
. use CEO_1.dta, clear
{txt}
{com}. local end = `obs' - 1
{txt}
{com}. forvalue i = 2(1)`end'{c -(}
{txt}  2{com}.         append using "CEO_`i'.dta"
{txt}  3{com}. {c )-}
{txt}D0101b was {res}str24{txt} now {res}str29
{txt}D0101b was {res}str29{txt} now {res}str39
{txt}D0101b was {res}str39{txt} now {res}str48
{txt}
{com}. 
. gen lenSKT = strlen(Stkcd)
{txt}
{com}. keep if lenSKT == 6
{txt}(14 observations deleted)

{com}. drop lenSKT
{txt}
{com}. rename Reptdt Accper
{res}{txt}
{com}. rename D0101b CEOName
{res}{txt}
{com}. rename D0301b CEOGender
{res}{txt}
{com}. replace CEOGender = "1" if CEOGender == "ÄÐ"
{txt}(351733 real changes made)

{com}. replace CEOGender = "0" if CEOGender == "Å®"
{txt}(60040 real changes made)

{com}. rename D0401b CEOAge
{res}{txt}
{com}. rename D0501b CEOEdu
{res}{txt}
{com}. rename D0901b CEOisSalary
{res}{txt}
{com}. rename D1001b CEOSalary
{res}{txt}
{com}. rename D1101b CEOShare
{res}{txt}
{com}. 
. destring _all, replace
{txt}Stkcd has all characters numeric; {res}replaced {txt}as {res}long
{txt}Accper contains nonnumeric characters; no {res}replace
{txt}CEOName contains nonnumeric characters; no {res}replace
{txt}CEOGender has all characters numeric; {res}replaced {txt}as {res}byte
{txt}CEOAge has all characters numeric; {res}replaced {txt}as {res}int
{txt}(1114 missing values generated)
CEOEdu has all characters numeric; {res}replaced {txt}as {res}byte
{txt}(239955 missing values generated)
CEOisSalary has all characters numeric; {res}replaced {txt}as {res}byte
{txt}(4019 missing values generated)
CEOSalary has all characters numeric; {res}replaced {txt}as {res}double
{txt}(77093 missing values generated)
CEOShare has all characters numeric; {res}replaced {txt}as {res}double
{txt}(2853 missing values generated)
source has all characters numeric; {res}replaced {txt}as {res}byte
{txt}
{com}. keep Stkcd Accper CEOGender CEOAge CEOSalary CEOShare
{txt}
{com}. collapse (mean)CEOGender CEOAge CEOSalary CEOShare, by(Stkcd Accper)
{txt}
{com}. tostring Stkcd, replace
{txt}Stkcd was {res:long} now {res:str6}

{com}. sort Stkcd Accper
{txt}
{com}. save CEO.dta, replace
{txt}file CEO.dta saved

{com}. 
. *5.7.CEO Incentive
. import excel using ..\RawData\Control_CEOIncentive\CG_Incperson.xls, firstrow clear
{res}{txt}
{com}. drop in 1/2
{txt}(2 observations deleted)

{com}. rename Pishrttl CEOIncentiveRatio
{res}{txt}
{com}. rename  Rptdt Accper
{res}{txt}
{com}. sort Stkcd Accper
{txt}
{com}. save CEOIncentive.dta, replace
{txt}file CEOIncentive.dta saved

{com}. 
. *6.IV - MainBusinessIncome
. import excel using ..\RawData\IV_MainBusinessIncome\FAR_Finidx.xls, firstrow clear
{res}{txt}
{com}. drop in 1/2
{txt}(2 observations deleted)

{com}. rename B110101 MainBusinessIncome
{res}{txt}
{com}. sort Stkcd Accper
{txt}
{com}. save MainBusinessIncome.dta, replace
{txt}file MainBusinessIncome.dta saved

{com}. 
. 
. ***************************************************************
. ************** MERGE                              *************
. ***************************************************************
. use DEratio.dta, clear
{txt}
{com}. *1.1:1
. merge Stkcd Accper using ROE.dta
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     27,840       24.78       24.78
{txt}          2 {c |}{res}        213        0.19       24.97
{txt}          3 {c |}{res}     84,310       75.03      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    112,363      100.00
{txt}
{com}. drop _merge
{txt}
{com}. sort Stkcd Accper
{txt}
{com}. 
. merge Stkcd Accper using AccountingPeriod.dta
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
Accper was {res}str10{txt} now {res}str12
{txt}
{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     23,680       21.03       21.03
{txt}          2 {c |}{res}        229        0.20       21.24
{txt}          3 {c |}{res}     88,683       78.76      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    112,592      100.00
{txt}
{com}. drop _merge
{txt}
{com}. sort Stkcd Accper
{txt}
{com}. 
. merge Stkcd Accper using LiquidityRatio.dta
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     89,501       78.67       78.67
{txt}          2 {c |}{res}      1,171        1.03       79.70
{txt}          3 {c |}{res}     23,091       20.30      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    113,763      100.00
{txt}
{com}. drop _merge
{txt}
{com}. sort Stkcd Accper
{txt}
{com}. 
. merge Stkcd Accper using PBratio.dta
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     23,987       20.88       20.88
{txt}          2 {c |}{res}      1,131        0.98       21.86
{txt}          3 {c |}{res}     89,776       78.14      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    114,894      100.00
{txt}
{com}. drop _merge
{txt}
{com}. sort Stkcd Accper
{txt}
{com}. 
. merge Stkcd Accper using SGA.dta
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     28,242       24.58       24.58
{txt}          2 {c |}{res}          1        0.00       24.58
{txt}          3 {c |}{res}     86,652       75.42      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    114,895      100.00
{txt}
{com}. drop _merge
{txt}
{com}. sort Stkcd Accper
{txt}
{com}. 
. merge Stkcd Accper using MainBusinessIncome.dta
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     90,246       78.55       78.55
{txt}          3 {c |}{res}     24,649       21.45      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    114,895      100.00
{txt}
{com}. drop _merge
{txt}
{com}. sort Stkcd Accper
{txt}
{com}. 
. merge Stkcd Accper using Shareholders.dta
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     71,673       62.38       62.38
{txt}          2 {c |}{res}          6        0.01       62.38
{txt}          3 {c |}{res}     43,222       37.62      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    114,901      100.00
{txt}
{com}. drop _merge
{txt}
{com}. sort Stkcd Accper
{txt}
{com}. 
. /*
> merge Stkcd Accper using CEOIncentive.dta
> tab _merge
> drop _merge
> sort Stkcd Accper 
> */
. 
. merge Stkcd Accper using CEO.dta
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}    102,445       82.07       82.07
{txt}          2 {c |}{res}      9,924        7.95       90.02
{txt}          3 {c |}{res}     12,456        9.98      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    124,825      100.00
{txt}
{com}. drop _merge
{txt}
{com}. sort Stkcd Accper 
{txt}
{com}. 
. 
. *2.m:1
. merge Stkcd using IPO.dta
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} Stkcd
does not uniquely identify observations in
the master data
{p_end}
{p 0 4 2}
variable{txt} Stkcd
does not uniquely identify observations in
IPO.dta
{p_end}

{com}. tab _merge

     {txt}_merge {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     17,001       13.61       13.61
{txt}          2 {c |}{res}         65        0.05       13.66
{txt}          3 {c |}{res}    107,824       86.34      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    124,890      100.00
{txt}
{com}. drop _merge
{txt}
{com}. sort Stkcd 
{txt}
{com}. /*
> merge Stkcd using IncomeTaxRate.dta
> tab _merge
> drop _merge
> sort Stkcd 
> */
. 
. destring _all, replace
{txt}Stkcd has all characters numeric; {res}replaced {txt}as {res}long
{txt}Accper contains nonnumeric characters; no {res}replace
{txt}Asset has all characters numeric; {res}replaced {txt}as {res}double
{txt}(12740 missing values generated)
Liability has all characters numeric; {res}replaced {txt}as {res}double
{txt}(12752 missing values generated)
ROE has all characters numeric; {res}replaced {txt}as {res}double
{txt}(40580 missing values generated)
Reptyp has all characters numeric; {res}replaced {txt}as {res}byte
{txt}(35978 missing values generated)
LiquidityRatio has all characters numeric; {res}replaced {txt}as {res}double
{txt}(100931 missing values generated)
PBRatio has all characters numeric; {res}replaced {txt}as {res}double
{txt}(34134 missing values generated)
Se has all characters numeric; {res}replaced {txt}as {res}double
{txt}(40237 missing values generated)
SGAe has all characters numeric; {res}replaced {txt}as {res}double
{txt}(40237 missing values generated)
Annodt contains nonnumeric characters; no {res}replace
{txt}MainBusinessIncome has all characters numeric; {res}replaced {txt}as {res}double
{txt}(100586 missing values generated)
HHI already numeric; no {res}replace
{txt}HHI5 already numeric; no {res}replace
{txt}HHI10 already numeric; no {res}replace
{txt}CEOGender already numeric; no {res}replace
{txt}CEOAge already numeric; no {res}replace
{txt}CEOSalary already numeric; no {res}replace
{txt}CEOShare already numeric; no {res}replace
{txt}Indcd has all characters numeric; {res}replaced {txt}as {res}byte
{txt}(17001 missing values generated)
Indnme contains nonnumeric characters; no {res}replace
{txt}IndClaCd has all characters numeric; {res}replaced {txt}as {res}byte
{txt}(17001 missing values generated)
Nindcd contains nonnumeric characters; no {res}replace
{txt}Nindnme contains nonnumeric characters; no {res}replace
{txt}Conmee contains nonnumeric characters; no {res}replace
{txt}Estbdt contains nonnumeric characters; no {res}replace
{txt}Listdt contains nonnumeric characters; no {res}replace
{txt}Regcap1 has all characters numeric; {res}replaced {txt}as {res}double
{txt}(20662 missing values generated)
Regcap2 has all characters numeric; {res}replaced {txt}as {res}double
{txt}(19947 missing values generated)

{com}. save main.dta, replace
{txt}file main.dta saved

{com}. 
. ***************************************************************
. ************** REGRESSION                         *************
. ***************************************************************
. use main.dta, clear
{txt}
{com}. *1.Initilization
. keep if Reptyp==4
{txt}(101418 observations deleted)

{com}. 
. *1.1.Duplication check 
. capture drop dup
{txt}
{com}. bysort Stkcd Accper: gen dup = _N
{txt}
{com}. gsort -dup Stkcd Accper
{txt}
{com}. 
. *1.2.Drop Dulicates
. bysort Stkcd Accper: keep if _n==1
{txt}(0 observations deleted)

{com}. gen year = year(date(Accper, "YMD"))
{txt}
{com}. gen AccDate = date(Accper, "YMD")
{txt}
{com}. xtset Stkcd AccDate
{res}{txt}{col 8}panel variable:  {res}Stkcd (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}AccDate, 15340 to 19723, but with gaps
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. 
. *1.3.Generating Variables 
. gen CorpAge = date(Accper,"YMD")-date(Estbdt,"YMD")
{txt}(1432 missing values generated)

{com}. gen CorpAge2 = CorpAge^2
{txt}(1432 missing values generated)

{com}. 
. gen ListAge = date(Accper,"YMD")-date(Listdt,"YMD")
{txt}(1419 missing values generated)

{com}. gen ListAge2 = ListAge^2
{txt}(1419 missing values generated)

{com}. 
. gen DERatio = Liability/(Asset - Liability)
{txt}(8 missing values generated)

{com}. gen Size = log(Asset)
{txt}(6 missing values generated)

{com}. 
. *Q1.
. local Y DERatio
{txt}
{com}. local X CorpAge CorpAge2 Size ROE
{txt}
{com}. local ControlVar LiquidityRatio HHI10 PBRatio SGAe 
{txt}
{com}. *OLS
. xi: reg `Y' `X' `ControlVar' i.Indcd i.year
{txt}i.Indcd{col 19}_IIndcd_1-6{col 39}(naturally coded; _IIndcd_1 omitted)
i.year{col 19}_Iyear_2001-2013{col 39}(naturally coded; _Iyear_2001 omitted)
note: _Iyear_2002 omitted because of collinearity
note: _Iyear_2003 omitted because of collinearity

      Source {c |}       SS       df       MS              Number of obs ={res}   19000
{txt}{hline 13}{char +}{hline 30}           F( 23, 18976) ={res}    0.87
    {txt}   Model {char |} {res} 15073.4388    23  655.366902           {txt}Prob > F      = {res} 0.6390
    {txt}Residual {char |} {res} 14267469.9 18976  751.869198           {txt}R-squared     = {res} 0.0011
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res}-0.0002
    {txt}   Total {char |} {res} 14282543.3 18999  751.752373           {txt}Root MSE      = {res}  27.42

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       DERatio{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}CorpAge {c |}{col 16}{res}{space 2} .0002106{col 28}{space 2} .0004552{col 39}{space 1}    0.46{col 48}{space 3}0.644{col 56}{space 4}-.0006816{col 69}{space 3} .0011028
{txt}{space 6}CorpAge2 {c |}{col 16}{res}{space 2} 2.48e-09{col 28}{space 2} 4.57e-08{col 39}{space 1}    0.05{col 48}{space 3}0.957{col 56}{space 4}-8.70e-08{col 69}{space 3} 9.20e-08
{txt}{space 10}Size {c |}{col 16}{res}{space 2} .1715524{col 28}{space 2} .1731739{col 39}{space 1}    0.99{col 48}{space 3}0.322{col 56}{space 4}-.1678838{col 69}{space 3} .5109886
{txt}{space 11}ROE {c |}{col 16}{res}{space 2}-.0143407{col 28}{space 2}   .01942{col 39}{space 1}   -0.74{col 48}{space 3}0.460{col 56}{space 4}-.0524057{col 69}{space 3} .0237243
{txt}LiquidityRatio {c |}{col 16}{res}{space 2}-.0455875{col 28}{space 2} .0441958{col 39}{space 1}   -1.03{col 48}{space 3}0.302{col 56}{space 4}-.1322153{col 69}{space 3} .0410403
{txt}{space 9}HHI10 {c |}{col 16}{res}{space 2} 1.134849{col 28}{space 2} 1.719222{col 39}{space 1}    0.66{col 48}{space 3}0.509{col 56}{space 4}-2.234978{col 69}{space 3} 4.504677
{txt}{space 7}PBRatio {c |}{col 16}{res}{space 2} .0648837{col 28}{space 2} .1631643{col 39}{space 1}    0.40{col 48}{space 3}0.691{col 56}{space 4}-.2549328{col 69}{space 3} .3847002
{txt}{space 10}SGAe {c |}{col 16}{res}{space 2}-.0000147{col 28}{space 2}  .000096{col 39}{space 1}   -0.15{col 48}{space 3}0.878{col 56}{space 4}-.0002028{col 69}{space 3} .0001734
{txt}{space 5}_IIndcd_2 {c |}{col 16}{res}{space 2}-.1821792{col 28}{space 2} 6.489844{col 39}{space 1}   -0.03{col 48}{space 3}0.978{col 56}{space 4}-12.90285{col 69}{space 3} 12.53849
{txt}{space 5}_IIndcd_3 {c |}{col 16}{res}{space 2} .6619136{col 28}{space 2} 6.529979{col 39}{space 1}    0.10{col 48}{space 3}0.919{col 56}{space 4}-12.13743{col 69}{space 3} 13.46125
{txt}{space 5}_IIndcd_4 {c |}{col 16}{res}{space 2} .2246017{col 28}{space 2} 6.508614{col 39}{space 1}    0.03{col 48}{space 3}0.972{col 56}{space 4}-12.53286{col 69}{space 3} 12.98206
{txt}{space 5}_IIndcd_5 {c |}{col 16}{res}{space 2}-.1495774{col 28}{space 2} 6.468705{col 39}{space 1}   -0.02{col 48}{space 3}0.982{col 56}{space 4}-12.82881{col 69}{space 3} 12.52966
{txt}{space 5}_IIndcd_6 {c |}{col 16}{res}{space 2}  .325475{col 28}{space 2} 6.512212{col 39}{space 1}    0.05{col 48}{space 3}0.960{col 56}{space 4}-12.43904{col 69}{space 3} 13.08999
{txt}{space 3}_Iyear_2002 {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 3}_Iyear_2003 {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 3}_Iyear_2004 {c |}{col 16}{res}{space 2} .1734073{col 28}{space 2} 1.088447{col 39}{space 1}    0.16{col 48}{space 3}0.873{col 56}{space 4}-1.960046{col 69}{space 3} 2.306861
{txt}{space 3}_Iyear_2005 {c |}{col 16}{res}{space 2} .1230339{col 28}{space 2} 1.087954{col 39}{space 1}    0.11{col 48}{space 3}0.910{col 56}{space 4}-2.009454{col 69}{space 3} 2.255521
{txt}{space 3}_Iyear_2006 {c |}{col 16}{res}{space 2}-.6428781{col 28}{space 2} 1.082809{col 39}{space 1}   -0.59{col 48}{space 3}0.553{col 56}{space 4} -2.76528{col 69}{space 3} 1.479523
{txt}{space 3}_Iyear_2007 {c |}{col 16}{res}{space 2}-1.209192{col 28}{space 2} 1.066169{col 39}{space 1}   -1.13{col 48}{space 3}0.257{col 56}{space 4}-3.298978{col 69}{space 3} .8805939
{txt}{space 3}_Iyear_2008 {c |}{col 16}{res}{space 2} 1.079265{col 28}{space 2} 1.060047{col 39}{space 1}    1.02{col 48}{space 3}0.309{col 56}{space 4}-.9985217{col 69}{space 3} 3.157052
{txt}{space 3}_Iyear_2009 {c |}{col 16}{res}{space 2}-1.332429{col 28}{space 2} 1.048731{col 39}{space 1}   -1.27{col 48}{space 3}0.204{col 56}{space 4}-3.388036{col 69}{space 3}  .723178
{txt}{space 3}_Iyear_2010 {c |}{col 16}{res}{space 2} -.464201{col 28}{space 2} 1.016627{col 39}{space 1}   -0.46{col 48}{space 3}0.648{col 56}{space 4}-2.456881{col 69}{space 3} 1.528479
{txt}{space 3}_Iyear_2011 {c |}{col 16}{res}{space 2}-.0197037{col 28}{space 2} 1.004515{col 39}{space 1}   -0.02{col 48}{space 3}0.984{col 56}{space 4}-1.988642{col 69}{space 3} 1.949235
{txt}{space 3}_Iyear_2012 {c |}{col 16}{res}{space 2}-.4949815{col 28}{space 2} 1.007535{col 39}{space 1}   -0.49{col 48}{space 3}0.623{col 56}{space 4}-2.469841{col 69}{space 3} 1.479878
{txt}{space 3}_Iyear_2013 {c |}{col 16}{res}{space 2}-.5459594{col 28}{space 2} 1.017232{col 39}{space 1}   -0.54{col 48}{space 3}0.591{col 56}{space 4}-2.539824{col 69}{space 3} 1.447906
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-3.255645{col 28}{space 2} 7.438663{col 39}{space 1}   -0.44{col 48}{space 3}0.662{col 56}{space 4}-17.83609{col 69}{space 3}  11.3248
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est store model12
{txt}
{com}. xi: reg `Y' `X' i.Indcd i.year
{txt}i.Indcd{col 19}_IIndcd_1-6{col 39}(naturally coded; _IIndcd_1 omitted)
i.year{col 19}_Iyear_2001-2013{col 39}(naturally coded; _Iyear_2001 omitted)

      Source {c |}       SS       df       MS              Number of obs ={res}   22026
{txt}{hline 13}{char +}{hline 30}           F( 21, 22004) ={res}    3.08
    {txt}   Model {char |} {res} 44097.5765    21  2099.88459           {txt}Prob > F      = {res} 0.0000
    {txt}Residual {char |} {res} 14984088.2 22004  680.971107           {txt}R-squared     = {res} 0.0029
{txt}{hline 13}{char +}{hline 30}           Adj R-squared = {res} 0.0020
    {txt}   Total {char |} {res} 15028185.8 22025  682.323987           {txt}Root MSE      = {res} 26.095

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     DERatio{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}CorpAge {c |}{col 14}{res}{space 2} .0003448{col 26}{space 2} .0003815{col 37}{space 1}    0.90{col 46}{space 3}0.366{col 54}{space 4} -.000403{col 67}{space 3} .0010926
{txt}{space 4}CorpAge2 {c |}{col 14}{res}{space 2}-1.22e-08{col 26}{space 2} 3.91e-08{col 37}{space 1}   -0.31{col 46}{space 3}0.754{col 54}{space 4}-8.88e-08{col 67}{space 3} 6.43e-08
{txt}{space 8}Size {c |}{col 14}{res}{space 2} .2970426{col 26}{space 2} .1390618{col 37}{space 1}    2.14{col 46}{space 3}0.033{col 54}{space 4} .0244715{col 67}{space 3} .5696136
{txt}{space 9}ROE {c |}{col 14}{res}{space 2}-.0143714{col 26}{space 2} .0184675{col 37}{space 1}   -0.78{col 46}{space 3}0.436{col 54}{space 4}-.0505689{col 67}{space 3} .0218262
{txt}{space 3}_IIndcd_2 {c |}{col 14}{res}{space 2}-9.155962{col 26}{space 2} 1.783211{col 37}{space 1}   -5.13{col 46}{space 3}0.000{col 54}{space 4}-12.65118{col 67}{space 3} -5.66074
{txt}{space 3}_IIndcd_3 {c |}{col 14}{res}{space 2}-8.275567{col 26}{space 2}   1.8533{col 37}{space 1}   -4.47{col 46}{space 3}0.000{col 54}{space 4}-11.90817{col 67}{space 3}-4.642966
{txt}{space 3}_IIndcd_4 {c |}{col 14}{res}{space 2}-8.716084{col 26}{space 2} 1.831863{col 37}{space 1}   -4.76{col 46}{space 3}0.000{col 54}{space 4}-12.30667{col 67}{space 3}-5.125502
{txt}{space 3}_IIndcd_5 {c |}{col 14}{res}{space 2}-8.993973{col 26}{space 2} 1.721552{col 37}{space 1}   -5.22{col 46}{space 3}0.000{col 54}{space 4}-12.36834{col 67}{space 3}-5.619608
{txt}{space 3}_IIndcd_6 {c |}{col 14}{res}{space 2}-8.589564{col 26}{space 2} 1.836083{col 37}{space 1}   -4.68{col 46}{space 3}0.000{col 54}{space 4}-12.18842{col 67}{space 3} -4.99071
{txt}{space 1}_Iyear_2002 {c |}{col 14}{res}{space 2}-.2222908{col 26}{space 2} 1.083299{col 37}{space 1}   -0.21{col 46}{space 3}0.837{col 54}{space 4}-2.345635{col 67}{space 3} 1.901054
{txt}{space 1}_Iyear_2003 {c |}{col 14}{res}{space 2}-.1789313{col 26}{space 2} 1.072876{col 37}{space 1}   -0.17{col 46}{space 3}0.868{col 54}{space 4}-2.281845{col 67}{space 3} 1.923982
{txt}{space 1}_Iyear_2004 {c |}{col 14}{res}{space 2} -.003657{col 26}{space 2}  1.05982{col 37}{space 1}   -0.00{col 46}{space 3}0.997{col 54}{space 4}-2.080979{col 67}{space 3} 2.073665
{txt}{space 1}_Iyear_2005 {c |}{col 14}{res}{space 2}-.0929914{col 26}{space 2} 1.067092{col 37}{space 1}   -0.09{col 46}{space 3}0.931{col 54}{space 4}-2.184569{col 67}{space 3} 1.998586
{txt}{space 1}_Iyear_2006 {c |}{col 14}{res}{space 2}-.9000662{col 26}{space 2}  1.05751{col 37}{space 1}   -0.85{col 46}{space 3}0.395{col 54}{space 4}-2.972861{col 67}{space 3} 1.172729
{txt}{space 1}_Iyear_2007 {c |}{col 14}{res}{space 2}-1.509599{col 26}{space 2}  1.04371{col 37}{space 1}   -1.45{col 46}{space 3}0.148{col 54}{space 4}-3.555346{col 67}{space 3} .5361483
{txt}{space 1}_Iyear_2008 {c |}{col 14}{res}{space 2} .6918176{col 26}{space 2} 1.042278{col 37}{space 1}    0.66{col 46}{space 3}0.507{col 54}{space 4}-1.351123{col 67}{space 3} 2.734758
{txt}{space 1}_Iyear_2009 {c |}{col 14}{res}{space 2}-1.669256{col 26}{space 2} 1.027513{col 37}{space 1}   -1.62{col 46}{space 3}0.104{col 54}{space 4}-3.683255{col 67}{space 3} .3447434
{txt}{space 1}_Iyear_2010 {c |}{col 14}{res}{space 2}-.5467386{col 26}{space 2} .9941648{col 37}{space 1}   -0.55{col 46}{space 3}0.582{col 54}{space 4}-2.495373{col 67}{space 3} 1.401896
{txt}{space 1}_Iyear_2011 {c |}{col 14}{res}{space 2}-.5162986{col 26}{space 2} .9850479{col 37}{space 1}   -0.52{col 46}{space 3}0.600{col 54}{space 4}-2.447063{col 67}{space 3} 1.414466
{txt}{space 1}_Iyear_2012 {c |}{col 14}{res}{space 2}-.9726033{col 26}{space 2} .9871549{col 37}{space 1}   -0.99{col 46}{space 3}0.325{col 54}{space 4}-2.907498{col 67}{space 3} .9622911
{txt}{space 1}_Iyear_2013 {c |}{col 14}{res}{space 2}-.9506436{col 26}{space 2} .9965022{col 37}{space 1}   -0.95{col 46}{space 3}0.340{col 54}{space 4}-2.903859{col 67}{space 3} 1.002572
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 3.178782{col 26}{space 2} 3.971013{col 37}{space 1}    0.80{col 46}{space 3}0.423{col 54}{space 4}-4.604689{col 67}{space 3} 10.96225
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est store model11
{txt}
{com}. est table, keep(`X') b se
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:model11} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 5}CorpAge {c |}{res} {ralign 10:.00034482}{txt} {space 1}
{space 12} {c |}{res} {ralign 10:.0003815}{txt} {space 1}
{res}{txt}{space 4}CorpAge2 {c |}{res} {ralign 10:-1.222e-08}{txt} {space 1}
{space 12} {c |}{res} {ralign 10:3.905e-08}{txt} {space 1}
{res}{txt}{space 8}Size {c |}{res} {ralign 10:.29704259}{txt} {space 1}
{space 12} {c |}{res} {ralign 10:.13906176}{txt} {space 1}
{res}{txt}{space 9}ROE {c |}{res} {ralign 10:-.01437137}{txt} {space 1}
{space 12} {c |}{res} {ralign 10:.01846747}{txt} {space 1}
{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}
{ralign 27:legend: b/se}

{com}. 
. *Fixed-Effect
. xtreg `Y' `X' `ControlVar' i.year, fe i(Stkcd)
{txt}note: 2013.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs      = {res}    19000
{txt}Group variable: {res}Stkcd                           {txt}Number of groups   = {res}     2534

{txt}R-sq:  within  = {res}0.0007                         {txt}Obs per group: min = {res}        1
{txt}       between = {res}0.0000                                        {txt}avg = {res}      7.5
{txt}       overall = {res}0.0005                                        {txt}max = {res}       11

                                                {txt}F({res}17{txt},{res}16449{txt})        = {res}     0.64
{txt}corr(u_i, Xb)  = {res}-0.0151                        {txt}Prob > F           =    {res}0.8604

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       DERatio{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}CorpAge {c |}{col 16}{res}{space 2} .0003456{col 28}{space 2} .0007925{col 39}{space 1}    0.44{col 48}{space 3}0.663{col 56}{space 4}-.0012078{col 69}{space 3}  .001899
{txt}{space 6}CorpAge2 {c |}{col 16}{res}{space 2}-2.01e-08{col 28}{space 2} 7.11e-08{col 39}{space 1}   -0.28{col 48}{space 3}0.777{col 56}{space 4}-1.59e-07{col 69}{space 3} 1.19e-07
{txt}{space 10}Size {c |}{col 16}{res}{space 2}-.2399601{col 28}{space 2} .4728366{col 39}{space 1}   -0.51{col 48}{space 3}0.612{col 56}{space 4}-1.166771{col 69}{space 3} .6868509
{txt}{space 11}ROE {c |}{col 16}{res}{space 2}-.0118325{col 28}{space 2} .0206753{col 39}{space 1}   -0.57{col 48}{space 3}0.567{col 56}{space 4}-.0523583{col 69}{space 3} .0286932
{txt}LiquidityRatio {c |}{col 16}{res}{space 2}-.0311967{col 28}{space 2} .0744564{col 39}{space 1}   -0.42{col 48}{space 3}0.675{col 56}{space 4}-.1771393{col 69}{space 3} .1147458
{txt}{space 9}HHI10 {c |}{col 16}{res}{space 2} .9081261{col 28}{space 2} 3.953852{col 39}{space 1}    0.23{col 48}{space 3}0.818{col 56}{space 4}-6.841852{col 69}{space 3} 8.658104
{txt}{space 7}PBRatio {c |}{col 16}{res}{space 2} .0846162{col 28}{space 2} .1896624{col 39}{space 1}    0.45{col 48}{space 3}0.656{col 56}{space 4}-.2871426{col 69}{space 3} .4563749
{txt}{space 10}SGAe {c |}{col 16}{res}{space 2}-.0000146{col 28}{space 2} .0001026{col 39}{space 1}   -0.14{col 48}{space 3}0.887{col 56}{space 4}-.0002157{col 69}{space 3} .0001865
{txt}{space 14} {c |}
{space 10}year {c |}
{space 9}2004  {c |}{col 16}{res}{space 2} .2332277{col 28}{space 2} 1.055805{col 39}{space 1}    0.22{col 48}{space 3}0.825{col 56}{space 4}-1.836264{col 69}{space 3} 2.302719
{txt}{space 9}2005  {c |}{col 16}{res}{space 2} .1542728{col 28}{space 2} 1.011651{col 39}{space 1}    0.15{col 48}{space 3}0.879{col 56}{space 4}-1.828672{col 69}{space 3} 2.137217
{txt}{space 9}2006  {c |}{col 16}{res}{space 2}-.5924221{col 28}{space 2} .9702147{col 39}{space 1}   -0.61{col 48}{space 3}0.541{col 56}{space 4}-2.494148{col 69}{space 3} 1.309304
{txt}{space 9}2007  {c |}{col 16}{res}{space 2}-1.096382{col 28}{space 2} .9150423{col 39}{space 1}   -1.20{col 48}{space 3}0.231{col 56}{space 4}-2.889964{col 69}{space 3} .6971997
{txt}{space 9}2008  {c |}{col 16}{res}{space 2} 1.103355{col 28}{space 2}  .882155{col 39}{space 1}    1.25{col 48}{space 3}0.211{col 56}{space 4} -.625764{col 69}{space 3} 2.832475
{txt}{space 9}2009  {c |}{col 16}{res}{space 2}-1.355388{col 28}{space 2} .8485165{col 39}{space 1}   -1.60{col 48}{space 3}0.110{col 56}{space 4}-3.018572{col 69}{space 3} .3077962
{txt}{space 9}2010  {c |}{col 16}{res}{space 2}-.2118468{col 28}{space 2} .7947928{col 39}{space 1}   -0.27{col 48}{space 3}0.790{col 56}{space 4}-1.769727{col 69}{space 3} 1.346033
{txt}{space 9}2011  {c |}{col 16}{res}{space 2} .3820568{col 28}{space 2} .7719908{col 39}{space 1}    0.49{col 48}{space 3}0.621{col 56}{space 4}-1.131129{col 69}{space 3} 1.895242
{txt}{space 9}2012  {c |}{col 16}{res}{space 2} .0398868{col 28}{space 2} .7826454{col 39}{space 1}    0.05{col 48}{space 3}0.959{col 56}{space 4}-1.494183{col 69}{space 3} 1.573956
{txt}{space 9}2013  {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2}  5.24365{col 28}{space 2} 9.360363{col 39}{space 1}    0.56{col 48}{space 3}0.575{col 56}{space 4}-13.10368{col 69}{space 3} 23.59097
{txt}{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       sigma_u {c |} {res} 8.4430404
       {txt}sigma_e {c |} {res} 27.809226
           {txt}rho {c |} {res} .08439702{txt}   (fraction of variance due to u_i)
{hline 15}{c BT}{hline 64}
F test that all u_i=0:     F({res}2533{txt}, {res}16449{txt}) = {res}    0.79         {txt}Prob > F = {res}1.0000
{txt}
{com}. est store model22
{txt}
{com}. xtreg `Y' `X' i.year, fe i(Stkcd)
{txt}note: 2013.year omitted because of collinearity

Fixed-effects (within) regression               Number of obs      = {res}    22026
{txt}Group variable: {res}Stkcd                           {txt}Number of groups   = {res}     2591

{txt}R-sq:  within  = {res}0.0006                         {txt}Obs per group: min = {res}        1
{txt}       between = {res}0.0041                                        {txt}avg = {res}      8.5
{txt}       overall = {res}0.0002                                        {txt}max = {res}       13

                                                {txt}F({res}15{txt},{res}19420{txt})        = {res}     0.75
{txt}corr(u_i, Xb)  = {res}-0.0424                        {txt}Prob > F           =    {res}0.7356

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     DERatio{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}CorpAge {c |}{col 14}{res}{space 2} .0003325{col 26}{space 2} .0005538{col 37}{space 1}    0.60{col 46}{space 3}0.548{col 54}{space 4} -.000753{col 67}{space 3}  .001418
{txt}{space 4}CorpAge2 {c |}{col 14}{res}{space 2}-1.69e-08{col 26}{space 2} 5.33e-08{col 37}{space 1}   -0.32{col 46}{space 3}0.751{col 54}{space 4}-1.21e-07{col 67}{space 3} 8.75e-08
{txt}{space 8}Size {c |}{col 14}{res}{space 2}-.1789746{col 26}{space 2} .3511954{col 37}{space 1}   -0.51{col 46}{space 3}0.610{col 54}{space 4}-.8673479{col 67}{space 3} .5093988
{txt}{space 9}ROE {c |}{col 14}{res}{space 2}-.0121642{col 26}{space 2} .0196913{col 37}{space 1}   -0.62{col 46}{space 3}0.537{col 54}{space 4}-.0507609{col 67}{space 3} .0264324
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2002  {c |}{col 14}{res}{space 2}-.2186731{col 26}{space 2} 1.064538{col 37}{space 1}   -0.21{col 46}{space 3}0.837{col 54}{space 4}-2.305259{col 67}{space 3} 1.867913
{txt}{space 7}2003  {c |}{col 14}{res}{space 2}-.1461356{col 26}{space 2} 1.013109{col 37}{space 1}   -0.14{col 46}{space 3}0.885{col 54}{space 4}-2.131917{col 67}{space 3} 1.839646
{txt}{space 7}2004  {c |}{col 14}{res}{space 2} .0801036{col 26}{space 2} .9625831{col 37}{space 1}    0.08{col 46}{space 3}0.934{col 54}{space 4}-1.806642{col 67}{space 3} 1.966849
{txt}{space 7}2005  {c |}{col 14}{res}{space 2} .0195199{col 26}{space 2} .9392883{col 37}{space 1}    0.02{col 46}{space 3}0.983{col 54}{space 4}-1.821566{col 67}{space 3} 1.860606
{txt}{space 7}2006  {c |}{col 14}{res}{space 2}-.7604921{col 26}{space 2} .9007498{col 37}{space 1}   -0.84{col 46}{space 3}0.399{col 54}{space 4}-2.526039{col 67}{space 3} 1.005055
{txt}{space 7}2007  {c |}{col 14}{res}{space 2}-1.281145{col 26}{space 2} .8566264{col 37}{space 1}   -1.50{col 46}{space 3}0.135{col 54}{space 4}-2.960207{col 67}{space 3} .3979162
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .8989209{col 26}{space 2}  .835594{col 37}{space 1}    1.08{col 46}{space 3}0.282{col 54}{space 4}-.7389152{col 67}{space 3} 2.536757
{txt}{space 7}2009  {c |}{col 14}{res}{space 2} -1.26887{col 26}{space 2} .8023828{col 37}{space 1}   -1.58{col 46}{space 3}0.114{col 54}{space 4} -2.84161{col 67}{space 3} .3038692
{txt}{space 7}2010  {c |}{col 14}{res}{space 2} .0514524{col 26}{space 2} .7496732{col 37}{space 1}    0.07{col 46}{space 3}0.945{col 54}{space 4}-1.417972{col 67}{space 3} 1.520877
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} .2392955{col 26}{space 2} .7295869{col 37}{space 1}    0.33{col 46}{space 3}0.743{col 54}{space 4}-1.190758{col 67}{space 3} 1.669349
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}-.1048609{col 26}{space 2} .7320327{col 37}{space 1}   -0.14{col 46}{space 3}0.886{col 54}{space 4}-1.539708{col 67}{space 3} 1.329986
{txt}{space 7}2013  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 4.336848{col 26}{space 2} 7.200014{col 37}{space 1}    0.60{col 46}{space 3}0.547{col 54}{space 4}-9.775799{col 67}{space 3}  18.4495
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 6.2217687
     {txt}sigma_e {c |} {res} 26.645698
         {txt}rho {c |} {res} .05170324{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0:     F({res}2590{txt}, {res}19420{txt}) = {res}    0.66         {txt}Prob > F = {res}1.0000
{txt}
{com}. est store model21
{txt}
{com}. estimate store fe
{txt}
{com}. 
. *Random-Effect
. xtreg `Y' `X' `ControlVar' i.year, re
{res}
{txt}Random-effects GLS regression                   Number of obs      = {res}    19000
{txt}Group variable: {res}Stkcd                           {txt}Number of groups   = {res}     2534

{txt}R-sq:  within  = {res}0.0006                         {txt}Obs per group: min = {res}        1
{txt}       between = {res}0.0041                                        {txt}avg = {res}      7.5
{txt}       overall = {res}0.0010                                        {txt}max = {res}       11

                                                {txt}Wald chi2({res}18{txt})      = {res}    18.92
{txt}corr(u_i, X)   = {res}0{txt} (assumed)                    Prob > chi2        =    {res}0.3966

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       DERatio{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      z{col 48}   P>|z|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}CorpAge {c |}{col 16}{res}{space 2} .0002056{col 28}{space 2} .0004547{col 39}{space 1}    0.45{col 48}{space 3}0.651{col 56}{space 4}-.0006857{col 69}{space 3} .0010968
{txt}{space 6}CorpAge2 {c |}{col 16}{res}{space 2} 5.07e-09{col 28}{space 2} 4.55e-08{col 39}{space 1}    0.11{col 48}{space 3}0.911{col 56}{space 4}-8.42e-08{col 69}{space 3} 9.43e-08
{txt}{space 10}Size {c |}{col 16}{res}{space 2} .1932912{col 28}{space 2} .1711264{col 39}{space 1}    1.13{col 48}{space 3}0.259{col 56}{space 4}-.1421103{col 69}{space 3} .5286927
{txt}{space 11}ROE {c |}{col 16}{res}{space 2}-.0141061{col 28}{space 2} .0194106{col 39}{space 1}   -0.73{col 48}{space 3}0.467{col 56}{space 4}-.0521501{col 69}{space 3} .0239379
{txt}LiquidityRatio {c |}{col 16}{res}{space 2}-.0470118{col 28}{space 2} .0440294{col 39}{space 1}   -1.07{col 48}{space 3}0.286{col 56}{space 4}-.1333079{col 69}{space 3} .0392843
{txt}{space 9}HHI10 {c |}{col 16}{res}{space 2} 1.006349{col 28}{space 2} 1.711989{col 39}{space 1}    0.59{col 48}{space 3}0.557{col 56}{space 4}-2.349088{col 69}{space 3} 4.361786
{txt}{space 7}PBRatio {c |}{col 16}{res}{space 2} .0677417{col 28}{space 2} .1630708{col 39}{space 1}    0.42{col 48}{space 3}0.678{col 56}{space 4}-.2518712{col 69}{space 3} .3873546
{txt}{space 10}SGAe {c |}{col 16}{res}{space 2}-.0000148{col 28}{space 2}  .000096{col 39}{space 1}   -0.15{col 48}{space 3}0.877{col 56}{space 4}-.0002029{col 69}{space 3} .0001732
{txt}{space 14} {c |}
{space 10}year {c |}
{space 9}2004  {c |}{col 16}{res}{space 2} .1651821{col 28}{space 2} 1.088291{col 39}{space 1}    0.15{col 48}{space 3}0.879{col 56}{space 4}-1.967829{col 69}{space 3} 2.298193
{txt}{space 9}2005  {c |}{col 16}{res}{space 2}  .104502{col 28}{space 2} 1.087641{col 39}{space 1}    0.10{col 48}{space 3}0.923{col 56}{space 4}-2.027235{col 69}{space 3} 2.236239
{txt}{space 9}2006  {c |}{col 16}{res}{space 2}-.6718699{col 28}{space 2} 1.082196{col 39}{space 1}   -0.62{col 48}{space 3}0.535{col 56}{space 4}-2.792936{col 69}{space 3} 1.449196
{txt}{space 9}2007  {c |}{col 16}{res}{space 2}-1.249148{col 28}{space 2} 1.065149{col 39}{space 1}   -1.17{col 48}{space 3}0.241{col 56}{space 4}-3.336803{col 69}{space 3} .8385063
{txt}{space 9}2008  {c |}{col 16}{res}{space 2} 1.031963{col 28}{space 2} 1.058683{col 39}{space 1}    0.97{col 48}{space 3}0.330{col 56}{space 4}-1.043018{col 69}{space 3} 3.106943
{txt}{space 9}2009  {c |}{col 16}{res}{space 2}-1.388471{col 28}{space 2}  1.04689{col 39}{space 1}   -1.33{col 48}{space 3}0.185{col 56}{space 4}-3.440338{col 69}{space 3}  .663395
{txt}{space 9}2010  {c |}{col 16}{res}{space 2}-.5327627{col 28}{space 2} 1.014121{col 39}{space 1}   -0.53{col 48}{space 3}0.599{col 56}{space 4}-2.520403{col 69}{space 3} 1.454877
{txt}{space 9}2011  {c |}{col 16}{res}{space 2}-.1012662{col 28}{space 2} 1.000962{col 39}{space 1}   -0.10{col 48}{space 3}0.919{col 56}{space 4}-2.063115{col 69}{space 3} 1.860583
{txt}{space 9}2012  {c |}{col 16}{res}{space 2}-.5874478{col 28}{space 2} 1.003035{col 39}{space 1}   -0.59{col 48}{space 3}0.558{col 56}{space 4} -2.55336{col 69}{space 3} 1.378465
{txt}{space 9}2013  {c |}{col 16}{res}{space 2}-.6512874{col 28}{space 2}   1.0115{col 39}{space 1}   -0.64{col 48}{space 3}0.520{col 56}{space 4}-2.633791{col 69}{space 3} 1.331216
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2} -3.73917{col 28}{space 2}  3.67024{col 39}{space 1}   -1.02{col 48}{space 3}0.308{col 56}{space 4}-10.93271{col 69}{space 3} 3.454369
{txt}{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       sigma_u {c |} {res}         0
       {txt}sigma_e {c |} {res} 27.809226
           {txt}rho {c |} {res}         0{txt}   (fraction of variance due to u_i)
{hline 15}{c BT}{hline 64}

{com}. est store model32
{txt}
{com}. xtreg `Y' `X' i.year, re
{res}
{txt}Random-effects GLS regression                   Number of obs      = {res}    22026
{txt}Group variable: {res}Stkcd                           {txt}Number of groups   = {res}     2591

{txt}R-sq:  within  = {res}0.0004                         {txt}Obs per group: min = {res}        1
{txt}       between = {res}0.0253                                        {txt}avg = {res}      8.5
{txt}       overall = {res}0.0017                                        {txt}max = {res}       13

                                                {txt}Wald chi2({res}16{txt})      = {res}    36.77
{txt}corr(u_i, X)   = {res}0{txt} (assumed)                    Prob > chi2        =    {res}0.0023

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     DERatio{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}CorpAge {c |}{col 14}{res}{space 2} .0002272{col 26}{space 2} .0003806{col 37}{space 1}    0.60{col 46}{space 3}0.551{col 54}{space 4}-.0005187{col 67}{space 3} .0009731
{txt}{space 4}CorpAge2 {c |}{col 14}{res}{space 2} 5.15e-09{col 26}{space 2} 3.89e-08{col 37}{space 1}    0.13{col 46}{space 3}0.895{col 54}{space 4}-7.11e-08{col 67}{space 3} 8.14e-08
{txt}{space 8}Size {c |}{col 14}{res}{space 2} .5587097{col 26}{space 2} .1292913{col 37}{space 1}    4.32{col 46}{space 3}0.000{col 54}{space 4} .3053034{col 67}{space 3} .8121161
{txt}{space 9}ROE {c |}{col 14}{res}{space 2}-.0140658{col 26}{space 2} .0184709{col 37}{space 1}   -0.76{col 46}{space 3}0.446{col 54}{space 4}-.0502681{col 67}{space 3} .0221366
{txt}{space 12} {c |}
{space 8}year {c |}
{space 7}2002  {c |}{col 14}{res}{space 2}-.2284054{col 26}{space 2} 1.083815{col 37}{space 1}   -0.21{col 46}{space 3}0.833{col 54}{space 4}-2.352643{col 67}{space 3} 1.895832
{txt}{space 7}2003  {c |}{col 14}{res}{space 2}-.2085418{col 26}{space 2} 1.073265{col 37}{space 1}   -0.19{col 46}{space 3}0.846{col 54}{space 4}-2.312103{col 67}{space 3} 1.895019
{txt}{space 7}2004  {c |}{col 14}{res}{space 2}-.0547631{col 26}{space 2} 1.059959{col 37}{space 1}   -0.05{col 46}{space 3}0.959{col 54}{space 4}-2.132245{col 67}{space 3} 2.022718
{txt}{space 7}2005  {c |}{col 14}{res}{space 2}-.1612773{col 26}{space 2} 1.066955{col 37}{space 1}   -0.15{col 46}{space 3}0.880{col 54}{space 4}-2.252472{col 67}{space 3} 1.929917
{txt}{space 7}2006  {c |}{col 14}{res}{space 2}-.9657855{col 26}{space 2} 1.057077{col 37}{space 1}   -0.91{col 46}{space 3}0.361{col 54}{space 4}-3.037617{col 67}{space 3} 1.106046
{txt}{space 7}2007  {c |}{col 14}{res}{space 2}-1.587466{col 26}{space 2} 1.042838{col 37}{space 1}   -1.52{col 46}{space 3}0.128{col 54}{space 4}-3.631391{col 67}{space 3} .4564588
{txt}{space 7}2008  {c |}{col 14}{res}{space 2} .5786808{col 26}{space 2}  1.04092{col 37}{space 1}    0.56{col 46}{space 3}0.578{col 54}{space 4}-1.461485{col 67}{space 3} 2.618846
{txt}{space 7}2009  {c |}{col 14}{res}{space 2}-1.818953{col 26}{space 2} 1.025454{col 37}{space 1}   -1.77{col 46}{space 3}0.076{col 54}{space 4}-3.828805{col 67}{space 3} .1908996
{txt}{space 7}2010  {c |}{col 14}{res}{space 2}-.7380886{col 26}{space 2} .9911423{col 37}{space 1}   -0.74{col 46}{space 3}0.456{col 54}{space 4}-2.680692{col 67}{space 3} 1.204515
{txt}{space 7}2011  {c |}{col 14}{res}{space 2} -.753209{col 26}{space 2} .9808054{col 37}{space 1}   -0.77{col 46}{space 3}0.443{col 54}{space 4}-2.675552{col 67}{space 3} 1.169134
{txt}{space 7}2012  {c |}{col 14}{res}{space 2}-1.256538{col 26}{space 2} .9816992{col 37}{space 1}   -1.28{col 46}{space 3}0.201{col 54}{space 4}-3.180633{col 67}{space 3} .6675573
{txt}{space 7}2013  {c |}{col 14}{res}{space 2}-1.291434{col 26}{space 2} .9896553{col 37}{space 1}   -1.30{col 46}{space 3}0.192{col 54}{space 4}-3.231123{col 67}{space 3} .6482547
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-11.00393{col 26}{space 2} 2.903809{col 37}{space 1}   -3.79{col 46}{space 3}0.000{col 54}{space 4}-16.69529{col 67}{space 3}-5.312574
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res}         0
     {txt}sigma_e {c |} {res} 26.645698
         {txt}rho {c |} {res}         0{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. est store model31
{txt}
{com}. estimate store re
{txt}
{com}. 
. *Q2.
. hausman fe re, sigmamore

{txt}{p 0 8}Note: the rank of the differenced variance matrix ({result:13}) does not equal the number of coefficients being tested ({result:15}); be sure this is what you expect, or there may be problems computing the test.  Examine the output of your estimators for anything unexpected and possibly consider scaling your variables so that the coefficients are on a similar scale.

{col 18}{hline 4} Coefficients {hline 4}
{col 14}{c |}{col 21}(b){col 34}(B){col 49}(b-B){col 59}sqrt(diag(V_b-V_B))
{col 14}{c |}{col 17}     fe     {col 30}     re     {col 46}Difference{col 66}S.E.
{hline 13}{c +}{hline 64}
     CorpAge {c |}  {res}{col 18} .0003325{col 31} .0002272{col 47} .0001053{col 63} .0003868
    {txt}CorpAge2 {c |}  {res}{col 18}-1.69e-08{col 31} 5.15e-09{col 47}-2.21e-08{col 63} 3.48e-08
        {txt}Size {c |}  {res}{col 18}-.1789746{col 31} .5587097{col 47}-.7376843{col 63} .3189101
         {txt}ROE {c |}  {res}{col 18}-.0121642{col 31}-.0140658{col 47} .0019015{col 63} .0055776
 {txt}2002bn.year {c |}  {res}{col 18}-.2186731{col 31}-.2284054{col 47} .0097324{col 63}        .
   {txt}2003.year {c |}  {res}{col 18}-.1461356{col 31}-.2085418{col 47} .0624062{col 63}        .
   {txt}2004.year {c |}  {res}{col 18} .0801036{col 31}-.0547631{col 47} .1348668{col 63}        .
   {txt}2005.year {c |}  {res}{col 18} .0195199{col 31}-.1612773{col 47} .1807973{col 63}        .
   {txt}2006.year {c |}  {res}{col 18}-.7604921{col 31}-.9657855{col 47} .2052934{col 63}        .
   {txt}2007.year {c |}  {res}{col 18}-1.281145{col 31}-1.587466{col 47} .3063207{col 63}        .
   {txt}2008.year {c |}  {res}{col 18} .8989209{col 31} .5786808{col 47} .3202401{col 63}        .
   {txt}2009.year {c |}  {res}{col 18} -1.26887{col 31}-1.818953{col 47} .5500826{col 63}        .
   {txt}2010.year {c |}  {res}{col 18} .0514524{col 31}-.7380886{col 47} .7895411{col 63}        .
   {txt}2011.year {c |}  {res}{col 18} .2392955{col 31} -.753209{col 47} .9925046{col 63}        .
   {txt}2012.year {c |}  {res}{col 18}-.1048609{col 31}-1.256538{col 47} 1.151677{col 63}        .
{txt}{hline 13}{c BT}{hline 64}
{ralign 78:b = consistent under Ho and Ha; obtained from xtreg}
{ralign 78:B = inconsistent under Ha, efficient under Ho; obtained from xtreg}

    Test:  Ho:  difference in coefficients not systematic

{ralign 25:chi2({res:13})} = (b-B)'[(V_b-V_B)^(-1)](b-B)
{col 27}=  {res}      9.38
{txt}{col 17}Prob>chi2 =  {res}    0.7435
{txt}{col 17}(V_b-V_B is not positive definite)

{com}. 
